IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-A-B PIC S9(18) COMP-5 VALUE 1.
    05 F-A-B-2 PIC S9(18) COMP-5 VALUE 2.
    05 F-AVERYVERYVERYLONGKEYNAMETHAT PIC S9(18) COMP-5 VALUE 3.
    05 F-AVERYVERYVERYLONGKEYNAMETH-2 PIC S9(18) COMP-5 VALUE 4.
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
