IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "PROCESS" USING BY CONTENT "hello" BY CONTENT "a".
    CALL "PROCESS" USING BY CONTENT 42 BY CONTENT "b".
    CALL "PROCESS" USING BY CONTENT "TRUE" BY CONTENT "c".
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. PROCESS.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM PROCESS.
END PROGRAM CHECK.
