IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-EXACT-MILLISECOND PIC X(15) VALUE "09:30:15.123000".
    05 F-SUB-MILLISECOND PIC X(15) VALUE "09:30:15.123456".
PROCEDURE DIVISION.
    STOP RUN.
