IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-TS PIC S9(18) COMP-5 VALUE 32535215999.
PROCEDURE DIVISION.
    STOP RUN.
