IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER.
10 FILLER COMP-2 VALUE 1.500000.
10 FILLER COMP-2 VALUE 2.500000.
    05 FILLER.
10 FILLER COMP-2 VALUE 3.500000.
10 FILLER COMP-2 VALUE 4.500000.
PROCEDURE DIVISION.
    STOP RUN.
