IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    01 MY-VAR PIC S9(18) COMP-5 VALUE 42.
    CALL "PROCESS" USING BY CONTENT 05 F-KEY.
    10 F-REF PIC X(6) VALUE "my_var".
    05 F-COUNT PIC S9(18) COMP-5 VALUE 42..
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. PROCESS.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM PROCESS.
END PROGRAM CHECK.
