IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER.
10 FILLER.
15 F-KEY.
20 F-REF PIC X(6) VALUE "my_var".
15 F-COUNT PIC S9(18) COMP-5 VALUE 42.
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
