IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC X(32) VALUE "1970-01-01T00:00:00.000001+00:00".
    05 FILLER PIC X(32) VALUE "1969-12-31T23:59:59.500000+00:00".
    05 FILLER PIC X(25) VALUE "1970-01-01T00:00:01+00:00".
PROCEDURE DIVISION.
    STOP RUN.
