IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-KEY PIC X(9) VALUE "it's here".  *> a comment
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
