IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 LITERAL-VALUE.
    05 F-KEY PIC X(9) VALUE "it's here".  *> a comment
PROCEDURE DIVISION.
    STOP RUN.
