IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-ROWS.
    10 FILLER.
        15 F-X PIC S9(18) COMP-5 VALUE 1.
        15 F-Y PIC X(1) VALUE "a".
    10 FILLER.
        15 F-X PIC S9(18) COMP-5 VALUE 2.
        15 F-Y PIC X(1) VALUE "b".
PROCEDURE DIVISION.
    STOP RUN.
