IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-DESCRIPTION PIC X(16) VALUE "# not a comment ".
    05 F-NAME PIC X(3) VALUE "foo".
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
