IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-DATE PIC X(10) VALUE "0099-05-27".
    05 F-NAIVE PIC X(19) VALUE "0001-01-01T12:30:00".
    05 F-RECENT PIC X(19) VALUE "2024-05-27T10:00:00".
PROCEDURE DIVISION.
    STOP RUN.
