IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER COMP-2 VALUE 1.5.
    05 FILLER PIC S9(18) COMP-5 VALUE 9007199254740993.
PROCEDURE DIVISION.
    STOP RUN.
