IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 LITERAL-VALUE.
    *> first
    05 FILLER PIC X(1) VALUE "a".
    *> second
    05 FILLER PIC X(1) VALUE "b".
PROCEDURE DIVISION.
    STOP RUN.
