IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA COMP-2 VALUE MY_VAR.
PROCEDURE DIVISION.
    STOP RUN.
