IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-OMAP-VALUE.

        10 F-FIRST PIC S9(18) COMP-5 VALUE 1.

    05 F-SIBLING-LISTS.

        10 F-NUMBERS.

            15 FILLER PIC S9(18) COMP-5 VALUE 1.
            15 FILLER PIC S9(18) COMP-5 VALUE 2.

        10 F-STRINGS.

            15 FILLER PIC X(1) VALUE "x".
            15 FILLER PIC X(1) VALUE "y".


    05 F-REF-MARKER-PRESENT.

        10 FILLER PIC X(5) VALUE "$keep".
        10 FILLER PIC X(1) VALUE "z".
PROCEDURE DIVISION.
    STOP RUN.
