IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER.
    10 FILLER PIC S9(18) COMP-5 VALUE 2.
    10 FILLER PIC X(5) VALUE "hello".  *> trailing note
    *> next element
    05 FILLER.
    10 FILLER PIC S9(18) COMP-5 VALUE 3.
    10 FILLER PIC X(5) VALUE "world".
PROCEDURE DIVISION.
    STOP RUN.
