IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 OTHER PIC X(4) VALUE "true".
01 MY-DATA.
    05 F-MAIN.
    10 F-X PIC S9(18) COMP-5 VALUE 1.
    10 F-Y PIC X(1) VALUE "s".
PROCEDURE DIVISION.
    STOP RUN.
