IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER.
10 FILLER PIC X(10) VALUE "2026-01-01".
10 FILLER PIC X(10) VALUE "2026-01-02".
    05 FILLER PIC X(1) VALUE SPACES.
    05 FILLER.
10 FILLER PIC X(10) VALUE "2026-02-03".
10 FILLER PIC X(10) VALUE "2026-02-04".
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
