IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA PIC X(8) VALUE "0aF".
PROCEDURE DIVISION.
    STOP RUN.
