IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-FIRST PIC S9(18) COMP-5 VALUE 1.
    05 F-REPEATED PIC X(1) VALUE "a".
    05 F-REPEATED-2 PIC X(1) VALUE "b".
PROCEDURE DIVISION.
    STOP RUN.
