IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "LIST" USING BY CONTENT 1.
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. LIST.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM LIST.
END PROGRAM CHECK.
