IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "OP" USING BY CONTENT "hello".
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. OP.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM OP.
END PROGRAM CHECK.
