IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC S9(18) COMP-5 VALUE 0.
    05 FILLER PIC S9(18) COMP-5 VALUE 1.
    05 FILLER PIC S9(18) COMP-5 VALUE 2.
    05 FILLER PIC S9(18) COMP-5 VALUE 3.
    05 FILLER PIC S9(18) COMP-5 VALUE 4.
    05 FILLER PIC S9(18) COMP-5 VALUE 5.
    05 FILLER PIC S9(18) COMP-5 VALUE 6.
    05 FILLER PIC S9(18) COMP-5 VALUE 7.
    05 FILLER PIC S9(18) COMP-5 VALUE 8.
    05 FILLER PIC S9(18) COMP-5 VALUE 9.
    05 FILLER PIC S9(18) COMP-5 VALUE 10.
    05 FILLER PIC S9(18) COMP-5 VALUE 11.
    05 FILLER PIC S9(18) COMP-5 VALUE 12.
    05 FILLER PIC S9(18) COMP-5 VALUE 13.
    05 FILLER PIC S9(18) COMP-5 VALUE 14.
    05 FILLER PIC S9(18) COMP-5 VALUE 15.
    05 FILLER PIC S9(18) COMP-5 VALUE 16.
    05 FILLER PIC S9(18) COMP-5 VALUE 17.
    05 FILLER PIC S9(18) COMP-5 VALUE 18.
    05 FILLER PIC S9(18) COMP-5 VALUE 19.
    05 FILLER PIC S9(18) COMP-5 VALUE 20.
    05 FILLER PIC S9(18) COMP-5 VALUE 21.
    05 FILLER PIC S9(18) COMP-5 VALUE 22.
    05 FILLER PIC S9(18) COMP-5 VALUE 23.
    05 FILLER PIC S9(18) COMP-5 VALUE 24.
    05 FILLER PIC S9(18) COMP-5 VALUE 25.
    05 FILLER PIC S9(18) COMP-5 VALUE 26.
    05 FILLER PIC S9(18) COMP-5 VALUE 27.
    05 FILLER PIC S9(18) COMP-5 VALUE 28.
    05 FILLER PIC S9(18) COMP-5 VALUE 29.
    05 FILLER PIC S9(18) COMP-5 VALUE 30.
    05 FILLER PIC S9(18) COMP-5 VALUE 31.
    05 FILLER PIC S9(18) COMP-5 VALUE 32.
    05 FILLER PIC S9(18) COMP-5 VALUE 33.
    05 FILLER PIC S9(18) COMP-5 VALUE 34.
    05 FILLER PIC S9(18) COMP-5 VALUE 35.
    05 FILLER PIC S9(18) COMP-5 VALUE 36.
    05 FILLER PIC S9(18) COMP-5 VALUE 37.
    05 FILLER PIC S9(18) COMP-5 VALUE 38.
    05 FILLER PIC S9(18) COMP-5 VALUE 39.
    05 FILLER PIC S9(18) COMP-5 VALUE 40.
    05 FILLER PIC S9(18) COMP-5 VALUE 41.
    05 FILLER PIC S9(18) COMP-5 VALUE 42.
    05 FILLER PIC S9(18) COMP-5 VALUE 43.
    05 FILLER PIC S9(18) COMP-5 VALUE 44.
    05 FILLER PIC S9(18) COMP-5 VALUE 45.
    05 FILLER PIC S9(18) COMP-5 VALUE 46.
    05 FILLER PIC S9(18) COMP-5 VALUE 47.
    05 FILLER PIC S9(18) COMP-5 VALUE 48.
    05 FILLER PIC S9(18) COMP-5 VALUE 49.
    05 FILLER PIC S9(18) COMP-5 VALUE 50.
    05 FILLER PIC S9(18) COMP-5 VALUE 51.
    05 FILLER PIC S9(18) COMP-5 VALUE 52.
    05 FILLER PIC S9(18) COMP-5 VALUE 53.
    05 FILLER PIC S9(18) COMP-5 VALUE 54.
    05 FILLER PIC S9(18) COMP-5 VALUE 55.
    05 FILLER PIC S9(18) COMP-5 VALUE 56.
    05 FILLER PIC S9(18) COMP-5 VALUE 57.
    05 FILLER PIC S9(18) COMP-5 VALUE 58.
    05 FILLER PIC S9(18) COMP-5 VALUE 59.
    05 FILLER PIC S9(18) COMP-5 VALUE 60.
    05 FILLER PIC S9(18) COMP-5 VALUE 61.
    05 FILLER PIC S9(18) COMP-5 VALUE 62.
    05 FILLER PIC S9(18) COMP-5 VALUE 63.
    05 FILLER PIC S9(18) COMP-5 VALUE 64.
    05 FILLER PIC S9(18) COMP-5 VALUE 65.
    05 FILLER PIC S9(18) COMP-5 VALUE 66.
    05 FILLER PIC S9(18) COMP-5 VALUE 67.
    05 FILLER PIC S9(18) COMP-5 VALUE 68.
    05 FILLER PIC S9(18) COMP-5 VALUE 69.
    05 FILLER PIC S9(18) COMP-5 VALUE 70.
    05 FILLER PIC S9(18) COMP-5 VALUE 71.
    05 FILLER PIC S9(18) COMP-5 VALUE 72.
    05 FILLER PIC S9(18) COMP-5 VALUE 73.
    05 FILLER PIC S9(18) COMP-5 VALUE 74.
    05 FILLER PIC S9(18) COMP-5 VALUE 75.
    05 FILLER PIC S9(18) COMP-5 VALUE 76.
    05 FILLER PIC S9(18) COMP-5 VALUE 77.
    05 FILLER PIC S9(18) COMP-5 VALUE 78.
    05 FILLER PIC S9(18) COMP-5 VALUE 79.
    05 FILLER PIC S9(18) COMP-5 VALUE 80.
    05 FILLER PIC S9(18) COMP-5 VALUE 81.
    05 FILLER PIC S9(18) COMP-5 VALUE 82.
    05 FILLER PIC S9(18) COMP-5 VALUE 83.
    05 FILLER PIC S9(18) COMP-5 VALUE 84.
    05 FILLER PIC S9(18) COMP-5 VALUE 85.
    05 FILLER PIC S9(18) COMP-5 VALUE 86.
    05 FILLER PIC S9(18) COMP-5 VALUE 87.
    05 FILLER PIC S9(18) COMP-5 VALUE 88.
    05 FILLER PIC S9(18) COMP-5 VALUE 89.
    05 FILLER PIC S9(18) COMP-5 VALUE 90.
    05 FILLER PIC S9(18) COMP-5 VALUE 91.
    05 FILLER PIC S9(18) COMP-5 VALUE 92.
    05 FILLER PIC S9(18) COMP-5 VALUE 93.
    05 FILLER PIC S9(18) COMP-5 VALUE 94.
    05 FILLER PIC S9(18) COMP-5 VALUE 95.
    05 FILLER PIC S9(18) COMP-5 VALUE 96.
    05 FILLER PIC S9(18) COMP-5 VALUE 97.
    05 FILLER PIC S9(18) COMP-5 VALUE 98.
    05 FILLER PIC S9(18) COMP-5 VALUE 99.
    05 FILLER PIC S9(18) COMP-5 VALUE 100.
    05 FILLER PIC S9(18) COMP-5 VALUE 101.
    05 FILLER PIC S9(18) COMP-5 VALUE 102.
    05 FILLER PIC S9(18) COMP-5 VALUE 103.
    05 FILLER PIC S9(18) COMP-5 VALUE 104.
    05 FILLER PIC S9(18) COMP-5 VALUE 105.
    05 FILLER PIC S9(18) COMP-5 VALUE 106.
    05 FILLER PIC S9(18) COMP-5 VALUE 107.
    05 FILLER PIC S9(18) COMP-5 VALUE 108.
    05 FILLER PIC S9(18) COMP-5 VALUE 109.
    05 FILLER PIC S9(18) COMP-5 VALUE 110.
    05 FILLER PIC S9(18) COMP-5 VALUE 111.
    05 FILLER PIC S9(18) COMP-5 VALUE 112.
    05 FILLER PIC S9(18) COMP-5 VALUE 113.
    05 FILLER PIC S9(18) COMP-5 VALUE 114.
    05 FILLER PIC S9(18) COMP-5 VALUE 115.
    05 FILLER PIC S9(18) COMP-5 VALUE 116.
    05 FILLER PIC S9(18) COMP-5 VALUE 117.
    05 FILLER PIC S9(18) COMP-5 VALUE 118.
    05 FILLER PIC S9(18) COMP-5 VALUE 119.
PROCEDURE DIVISION.
    STOP RUN.
