IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
42  *> note
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
