IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA PIC X(26) VALUE "2024-01-15T12:30:45.123456".
PROCEDURE DIVISION.
    MOVE "2024-01-15T12:30:45.123456" TO MY-DATA.
    STOP RUN.
