IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    *> server
    05 F-HOST PIC X(9) VALUE "localhost".  *> default
PROCEDURE DIVISION.
    STOP RUN.
