IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-USER-NAME PIC S9(18) COMP-5 VALUE 1.
    05 F-USER-NAME-2 PIC S9(18) COMP-5 VALUE 2.
    05 F-USER-NAME-3 PIC S9(18) COMP-5 VALUE 3.
    05 F-FIELD-NAME-THAT-IS-REALLY-QU PIC S9(18) COMP-5 VALUE 4.
    05 F-FIELD-NAME-THAT-IS-REALLY-2 PIC S9(18) COMP-5 VALUE 5.
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
