IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 LITERAL-VALUE.
    05 FILLER PIC X(1) VALUE "a".
    *> trailing
PROCEDURE DIVISION.
    STOP RUN.
