IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER.
10 F-ID PIC S9(18) COMP-5 VALUE 100.
10 F-LABEL PIC X(11) VALUE "first entry".
10 F-ENABLED PIC X(5) VALUE "FALSE".
10 F-RELATED-IDS.
15 FILLER PIC S9(18) COMP-5 VALUE 102.
15 FILLER PIC S9(18) COMP-5 VALUE 103.
    05 FILLER.
10 F-ID PIC S9(18) COMP-5 VALUE 101.
10 F-LABEL PIC X(12) VALUE "second entry".
10 F-ENABLED PIC X(5) VALUE "TRUE".
10 F-RELATED-IDS.
15 FILLER PIC S9(18) COMP-5 VALUE 100.
PROCEDURE DIVISION.
    STOP RUN.
