IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA PIC X(13) VALUE "hello # world".
PROCEDURE DIVISION.
    MOVE "hello # world" TO MY-DATA.
    STOP RUN.
