IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA PIC X(6) VALUE "aface".
PROCEDURE DIVISION.
    STOP RUN.
