IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 A-B PIC S9(18) COMP-5 VALUE 1.
PROCEDURE DIVISION.
    STOP RUN.
