IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N0 USAGE POINTER.
01 N1 USAGE POINTER.
01 N1-V PIC X(2) VALUE X"00" & X"00".
01 N1-K PIC X(2) VALUE "x" & X"00".
01 N2 USAGE POINTER.
01 N2-V PIC X(3) VALUE X"00" & "1" & X"00".
01 N2-K PIC X(2) VALUE "y" & X"00".
01 N-STATUS PIC S9(9) COMP-5.
01 MY-DATA USAGE POINTER.
PROCEDURE DIVISION.
    CALL "cJSON_CreateObject" RETURNING N0.
    CALL "cJSON_CreateString" USING BY REFERENCE N1-V RETURNING N1.
    CALL "cJSON_AddItemToObject" USING BY VALUE N0 BY REFERENCE N1-K BY VALUE N1 RETURNING N-STATUS.
    CALL "cJSON_CreateString" USING BY REFERENCE N2-V RETURNING N2.
    CALL "cJSON_AddItemToObject" USING BY VALUE N0 BY REFERENCE N2-K BY VALUE N2 RETURNING N-STATUS.
    SET MY-DATA TO N0.
    STOP RUN.
