IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER.
10 F-NAME PIC X(5) VALUE "Alice".
10 F-NAME PIC X(3) VALUE "Bob".
    05 FILLER.
10 F-NAME PIC X(7) VALUE "Charlie".
10 F-NAME PIC X(4) VALUE "Dave".
PROCEDURE DIVISION.
    STOP RUN.
