IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-FILLER.
    10 FILLER PIC S9(18) COMP-5 VALUE 1.
    10 FILLER COMP-2 VALUE 2.5.
    10 FILLER PIC S9(18) COMP-5 VALUE 3.
PROCEDURE DIVISION.
    STOP RUN.
