IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-FIRST.
    10 F-X PIC S9(18) COMP-5 VALUE 1.
    10 F-Y PIC S9(18) COMP-5 VALUE 2.
    05 F-SECOND.
    10 F-Z PIC S9(18) COMP-5 VALUE 3.
PROCEDURE DIVISION.
    STOP RUN.
