IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-OUTER.
10 F-A PIC S9(18) COMP-5 VALUE 1.
10 F-B PIC X(1) VALUE "x".
10 F-C PIC X(1) VALUE SPACES.
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
