IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-ITEMS.
10 F-ID PIC S9(18) COMP-5 VALUE 1.
10 FILLER.
15 F-ID PIC S9(18) COMP-5 VALUE 2.
15 F-COUNT PIC S9(18) COMP-5 VALUE 10.
10 FILLER.
15 F-ID PIC S9(18) COMP-5 VALUE 3.
15 F-COUNT PIC S9(18) COMP-5 VALUE 20.
PROCEDURE DIVISION.
    STOP RUN.
