IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC S9(18) COMP-5 VALUE 1705321800.
    05 FILLER PIC S9(18) COMP-5 VALUE 1717228800.
PROCEDURE DIVISION.
    STOP RUN.
