IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-MINIMUM PIC S9(18) COMP-5 VALUE -2147483648.
    05 F-BELOW PIC S9(18) COMP-5 VALUE -3000000000.
PROCEDURE DIVISION.
    STOP RUN.
