IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N0 USAGE POINTER.
01 N1 USAGE POINTER.
01 N1-V PIC X(11) VALUE "2024-01-15" & X"00".
01 N2 USAGE POINTER.
01 N2-V PIC X(11) VALUE "2024-06-01" & X"00".
01 N-STATUS PIC S9(9) COMP-5.
01 MY-DATA USAGE POINTER.
PROCEDURE DIVISION.
    CALL "cJSON_CreateArray" RETURNING N0.
    CALL "cJSON_CreateString" USING BY REFERENCE N1-V RETURNING N1.
    CALL "cJSON_AddItemToArray" USING BY VALUE N0 BY VALUE N1 RETURNING N-STATUS.
    CALL "cJSON_CreateString" USING BY REFERENCE N2-V RETURNING N2.
    CALL "cJSON_AddItemToArray" USING BY VALUE N0 BY VALUE N2 RETURNING N-STATUS.
    SET MY-DATA TO N0.
    STOP RUN.
