IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC X(1) VALUE "a".  *> note a
    05 FILLER PIC X(1) VALUE "b".  *> note b
PROCEDURE DIVISION.
    STOP RUN.
