IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "CLASS" USING BY CONTENT 1.
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. CLASS.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM CLASS.
END PROGRAM CHECK.
