IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-HOST PIC X(9) VALUE "localhost".
    05 F-PORT PIC X(1) VALUE SPACES.  *> not configured yet
PROCEDURE DIVISION.
    STOP RUN.
