IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC S9(18) COMP-5 VALUE 0.
    05 FILLER PIC S9(18) COMP-5 VALUE 1.
    05 FILLER PIC S9(18) COMP-5 VALUE -1.
PROCEDURE DIVISION.
    STOP RUN.
