IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-GROUPS.
    10 F-ID PIC S9(18) COMP-5 VALUE 1.
    10 F-ID-2 PIC S9(18) COMP-5 VALUE 2.
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
