IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC X(1) VALUE "]".
    05 FILLER PIC X(2) VALUE "a]".
    05 FILLER PIC X(3) VALUE "a]=".
    05 FILLER PIC X(3) VALUE "a]b".
PROCEDURE DIVISION.
    STOP RUN.
