IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-FILLER.
    10 FILLER.
        15 F-TYPE PIC X(6) VALUE "create".
        15 F-NAME PIC X(1) VALUE "a".
    10 FILLER.
        15 F-TYPE PIC X(6) VALUE "update".
        15 F-NAME PIC X(1) VALUE "b".
PROCEDURE DIVISION.
    STOP RUN.
