IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-0A PIC X(5) VALUE "first".
    05 F-1B PIC X(6) VALUE "second".
PROCEDURE DIVISION.
    STOP RUN.
