IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "PUT" USING BY CONTENT 1 BY CONTENT 10.
    CALL "GET" USING BY CONTENT 1.
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. PUT.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM PUT.
IDENTIFICATION DIVISION.
PROGRAM-ID. GET.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM GET.
END PROGRAM CHECK.
