IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "STORE-ITEM" USING BY CONTENT 1 BY CONTENT 10.
    CALL "READ-ITEM" USING BY CONTENT 1.
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. STORE-ITEM.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM STORE-ITEM.
IDENTIFICATION DIVISION.
PROGRAM-ID. READ-ITEM.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM READ-ITEM.
END PROGRAM CHECK.
