IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-A PIC S9(18) COMP-5 VALUE 1.
    05 F-B PIC S9(18) COMP-5 VALUE 1099511627776.
PROCEDURE DIVISION.
    STOP RUN.
