IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-A PIC S9(18) COMP-5 VALUE 1.
    05 F-B PIC X(1) VALUE "x".
    05 F-E.
    10 FILLER PIC S9(18) COMP-5 VALUE 1.
    10 FILLER PIC S9(18) COMP-5 VALUE 2.
    05 F-F.
    10 F-G PIC X(1) VALUE "h".
PROCEDURE DIVISION.
    STOP RUN.
