IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "PROCESS" USING BY CONTENT 1.
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. PROCESS.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM PROCESS.
END PROGRAM CHECK.
