IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "PROCESS" USING BY CONTENT 1 BY CONTENT 2 BY CONTENT 3 BY CONTENT 4.
    CALL "PROCESS" USING BY CONTENT 5 BY CONTENT 6 BY CONTENT 7 BY CONTENT 8.
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. PROCESS.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM PROCESS.
END PROGRAM CHECK.
