IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC X(8) VALUE "SGVsbG8=".
PROCEDURE DIVISION.
    STOP RUN.
