IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER COMP-2 VALUE .
    05 FILLER PIC X(1) VALUE SPACES.
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
