IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA PIC X(26) VALUE "2024-01-15T12:30:01.123000".
PROCEDURE DIVISION.
    STOP RUN.
