IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-TITLE PIC X(6) VALUE "report".
    05 F-TAGS.
10 FILLER PIC X(5) VALUE "draft".
10 FILLER PIC X(6) VALUE "urgent".
10 FILLER PIC X(6) VALUE "review".
    05 F-PRIORITY PIC S9(18) COMP-5 VALUE 2.
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
