IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER.
10 FILLER PIC X(3) VALUE "ADD".  *> removes "world"
10 FILLER PIC X(5) VALUE "alice".
10 FILLER PIC X(5) VALUE "hello".
    05 FILLER.
10 FILLER PIC X(3) VALUE "DEL".
10 FILLER PIC X(3) VALUE "bob".
10 FILLER PIC X(1) VALUE "5".
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
