IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC X(9) VALUE "100% done".
    05 FILLER PIC X(15) VALUE "%(name) is here".
PROCEDURE DIVISION.
    STOP RUN.
