IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER COMP-2 VALUE X.
    05 FILLER COMP-2 VALUE Y.
PROCEDURE DIVISION.
    STOP RUN.
