IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER.
    10 F-TYPE PIC X(6) VALUE "create".
    10 F-NAME PIC X(1) VALUE "a".
    05 FILLER.
    10 F-TYPE PIC X(6) VALUE "update".
    10 F-NAME PIC X(1) VALUE "b".
PROCEDURE DIVISION.
    STOP RUN.
