IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-REFERENCE PIC X(5) VALUE "whole".
PROCEDURE DIVISION.
    STOP RUN.
