IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-FILLER PIC X(14) VALUE "external_value".
PROCEDURE DIVISION.
    STOP RUN.
