IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER.
10 F-REF PIC X(12) VALUE "repeated_var".
10 FILLER PIC S9(18) COMP-5 VALUE 1.
    05 FILLER.
10 F-REF PIC X(10) VALUE "single_var".
10 FILLER PIC S9(18) COMP-5 VALUE 0.
    05 FILLER.
10 F-REF PIC X(12) VALUE "repeated_var".
10 FILLER PIC S9(18) COMP-5 VALUE 8.
PROCEDURE DIVISION.
    STOP RUN.
