IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER.
10 F-CALL PIC X(4) VALUE "send".
10 F-ARGS.
15 FILLER PIC S9(18) COMP-5 VALUE 1.
15 FILLER PIC X(5) VALUE "email".
15 FILLER PIC X(11) VALUE "a@gmail.com".
15 FILLER PIC S9(18) COMP-5 VALUE 100.
    05 FILLER.
10 F-CALL PIC X(4) VALUE "recv".
10 F-ARGS.
15 FILLER PIC S9(18) COMP-5 VALUE 2.
15 FILLER PIC X(3) VALUE "sms".
15 FILLER PIC X(13) VALUE "b@example.com".
15 FILLER PIC S9(18) COMP-5 VALUE 200.
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
