IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER COMP-2 VALUE 9.99E99.
    05 FILLER COMP-2 VALUE -9.99E99.
    05 FILLER COMP-2 VALUE 0.0.
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
