IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER COMP-2 VALUE 1.0e-9.
    05 FILLER COMP-2 VALUE -1.0e-9.
PROCEDURE DIVISION.
    STOP RUN.
