IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-MIXED.
10 FILLER PIC X(8) VALUE "09:30:00".
10 FILLER PIC X(1) VALUE SPACES.
PROCEDURE DIVISION.
    STOP RUN.
