IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-SCORES.
10 FILLER PIC S9(18) COMP-5 VALUE 10.
10 FILLER PIC S9(18) COMP-5 VALUE 20.
10 FILLER PIC S9(18) COMP-5 VALUE 30.
    05 F-ARGS.
10 FILLER PIC S9(18) COMP-5 VALUE 1.
10 FILLER PIC X(5) VALUE "email".
10 FILLER PIC X(11) VALUE "a@gmail.com".
10 FILLER PIC S9(18) COMP-5 VALUE 100.
PROCEDURE DIVISION.
    STOP RUN.
