IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-REF PIC X(6) VALUE "my_str".
PROCEDURE DIVISION.
    STOP RUN.
