IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC X(19) VALUE "2024-01-15T12:30:00".
PROCEDURE DIVISION.
    STOP RUN.
