IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "SELF" USING BY CONTENT "hello".
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. SELF.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM SELF.
END PROGRAM CHECK.
