IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC X(4) VALUE "café".
    05 FILLER PIC X(2) VALUE "中文".
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
