IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC X(5) VALUE "café".
    05 FILLER PIC X(6) VALUE "中文".
    05 FILLER PIC X(4) VALUE "😀".
PROCEDURE DIVISION.
    STOP RUN.
