IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER.
10 F-ID PIC S9(18) COMP-5 VALUE 1.
10 F-LABEL PIC X(5) VALUE "first".
10 F-TAGS.
15 FILLER PIC X(1) VALUE SPACES.
    05 FILLER.
10 F-ID PIC S9(18) COMP-5 VALUE 2.
10 F-LABEL PIC X(6) VALUE "second".
10 F-TAGS.
15 FILLER PIC X(1) VALUE SPACES.
    05 FILLER.
10 F-ID PIC S9(18) COMP-5 VALUE 3.
10 F-LABEL PIC X(5) VALUE "third".
10 F-TAGS.
15 FILLER PIC X(1) VALUE SPACES.
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
