IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    *> line 1
    *> line 2
    05 FILLER PIC X(1) VALUE "a".
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
