IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "CHECK-WRAPPER" USING BY CONTENT 42.
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK-WRAPPER.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM CHECK-WRAPPER.
END PROGRAM CHECK.
