IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-FIRST.
    10 FILLER PIC S9(18) COMP-5 VALUE 1.
    10 FILLER PIC S9(18) COMP-5 VALUE 2.
    05 F-SECOND PIC S9(18) COMP-5 VALUE 3.  *> About the second key.
PROCEDURE DIVISION.
    STOP RUN.
