IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-A.
    10 F-B.
        15 FILLER PIC S9(18) COMP-5 VALUE 1.
        15 FILLER PIC S9(18) COMP-5 VALUE 2.
        15 FILLER PIC S9(18) COMP-5 VALUE 3.
PROCEDURE DIVISION.
    STOP RUN.
