IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-ID PIC S9(18) COMP-5 VALUE 1.
    05 F-OWNER.
10 F-NAME PIC X(5) VALUE "Alice".
10 F-AGE PIC S9(18) COMP-5 VALUE 30.
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
