IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA PIC X(30) VALUE "hello ""world"" -- not a comment".
PROCEDURE DIVISION.
    STOP RUN.
