IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-WITHIN-I32 PIC X(19) VALUE "2024-01-15T12:00:00".
    05 F-BEYOND-I32 PIC X(19) VALUE "2099-06-15T08:30:00".
PROCEDURE DIVISION.
    STOP RUN.
