IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER.
    10 FILLER PIC X(8) VALUE "set_task".
    10 FILLER PIC X(3) VALUE "web".
    10 FILLER PIC X(8) VALUE "lint_web".
    05 FILLER PIC X(15) VALUE "merge_pipelines".
PROCEDURE DIVISION.
    STOP RUN.
