IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "NEW" USING BY CONTENT 1.
    CALL "NEW" USING BY CONTENT 2.
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. NEW.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM NEW.
END PROGRAM CHECK.
