IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "PROCESS" USING BY CONTENT 1 BY CONTENT 0 BY CONTENT 3600.  *> Jan 1 1970 00:00:00 - 01:00:00
    CALL "PROCESS" USING BY CONTENT 5 BY CONTENT 0 BY CONTENT 3600.  *> Jan 1 1970 00:00:05 - 01:00:05
    CALL "PROCESS" USING BY CONTENT 2 BY CONTENT 0 BY CONTENT 5400.  *> Jan 1 1970 00:00:02 - 01:30:02
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. PROCESS.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM PROCESS.
END PROGRAM CHECK.
