IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-ROWS.
10 FILLER.
15 F-REPLACEMENT PIC S9(18) COMP-5 VALUE -1.
15 F-PRESENT PIC S9(18) COMP-5 VALUE 1.
10 FILLER.
15 F-REPLACEMENT PIC S9(18) COMP-5 VALUE 2.
15 F-PRESENT PIC S9(18) COMP-5 VALUE 3.
PROCEDURE DIVISION.
    STOP RUN.
