IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER.
10 F-MISSING PIC X(1) VALUE SPACES.
10 F-PRESENT PIC S9(18) COMP-5 VALUE 1.
    05 FILLER.
10 F-MISSING PIC S9(18) COMP-5 VALUE 2.
10 F-PRESENT PIC S9(18) COMP-5 VALUE 3.
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
