IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-A.
10 FILLER PIC X(1) VALUE SPACES.
    05 F-B.
10 FILLER PIC X(1) VALUE SPACES.
PROCEDURE DIVISION.
    STOP RUN.
