IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-ASSERT PIC S9(18) COMP-5 VALUE 1.
    05 F-ELSE PIC S9(18) COMP-5 VALUE 1.
    05 F-ERROR PIC S9(18) COMP-5 VALUE 1.
    05 F-FALSE PIC S9(18) COMP-5 VALUE 1.
    05 F-FOR PIC S9(18) COMP-5 VALUE 1.
    05 F-FUNCTION PIC S9(18) COMP-5 VALUE 1.
    05 F-IF PIC S9(18) COMP-5 VALUE 1.
    05 F-IMPORT PIC S9(18) COMP-5 VALUE 1.
    05 F-IMPORTBIN PIC S9(18) COMP-5 VALUE 1.
    05 F-IMPORTSTR PIC S9(18) COMP-5 VALUE 1.
    05 F-IN PIC S9(18) COMP-5 VALUE 1.
    05 F-LOCAL PIC S9(18) COMP-5 VALUE 1.
    05 F-NULL PIC S9(18) COMP-5 VALUE 1.
    05 F-SELF PIC S9(18) COMP-5 VALUE 1.
    05 F-SUPER PIC S9(18) COMP-5 VALUE 1.
    05 F-TAILSTRICT PIC S9(18) COMP-5 VALUE 1.
    05 F-THEN PIC S9(18) COMP-5 VALUE 1.
    05 F-TRUE PIC S9(18) COMP-5 VALUE 1.
    05 F-ORDINARY PIC S9(18) COMP-5 VALUE 1.
PROCEDURE DIVISION.
    STOP RUN.
