IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-A.
    10 FILLER PIC S9(18) COMP-5 VALUE 1.
    10 FILLER PIC S9(18) COMP-5 VALUE 2.
    05 F-B.
    10 FILLER PIC X(1) VALUE "x".
    10 FILLER PIC X(1) VALUE "y".
PROCEDURE DIVISION.
    STOP RUN.
