IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    01 MY-VAR PIC S9(18) COMP-5 VALUE 42.
    01 MY-OTHER PIC S9(18) COMP-5 VALUE 7.
    CALL "PROCESS" USING BY CONTENT 05 F-REF PIC X(6) VALUE "my_var".
    05 FILLER PIC S9(18) COMP-5 VALUE 42.
    05 FILLER PIC X(6) VALUE "static"..
    CALL "PROCESS" USING BY CONTENT 05 F-REF PIC X(8) VALUE "my_other".
    05 FILLER PIC S9(18) COMP-5 VALUE 7.
    05 FILLER PIC X(5) VALUE "label"..
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. PROCESS.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM PROCESS.
END PROGRAM CHECK.
