IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER.
10 FILLER.
15 F-REF PIC X(6) VALUE "my_var".
15 FILLER PIC S9(18) COMP-5 VALUE 42.
15 FILLER PIC X(6) VALUE "static".
    05 FILLER.
10 FILLER.
15 F-REF PIC X(8) VALUE "my_other".
15 FILLER PIC S9(18) COMP-5 VALUE 7.
15 FILLER PIC X(5) VALUE "label".
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
