IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER COMP-2 VALUE 5.0e-324.
    05 FILLER COMP-2 VALUE 2.2250738585072014e-308.
    05 FILLER COMP-2 VALUE 1.0e-307.
    05 FILLER COMP-2 VALUE 1.0e21.
    05 FILLER COMP-2 VALUE -1.5e300.
    05 FILLER COMP-2 VALUE 1.7976931348623157e308.
    05 FILLER COMP-2 VALUE -1.7976931348623157e308.
PROCEDURE DIVISION.
    STOP RUN.
