IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER.

        10 F-A PIC S9(18) COMP-5 VALUE 1.

    05 FILLER PIC X(5) VALUE "hello".
PROCEDURE DIVISION.
    STOP RUN.
