IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-H.
    10 FILLER PIC S9(18) COMP-5 VALUE 1.
    10 FILLER PIC X(1) VALUE "a".
    10 FILLER.
        15 FILLER PIC S9(18) COMP-5 VALUE 2.
        15 FILLER PIC X(1) VALUE "b".
    10 FILLER.
        15 F-K.
            20 FILLER PIC S9(18) COMP-5 VALUE 1.
PROCEDURE DIVISION.
    STOP RUN.
