IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA PIC X(10) VALUE "2024-01-15".
PROCEDURE DIVISION.
    STOP RUN.
