IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-COMMA-HASH PIC X(4) VALUE "a,#b".
    05 F-COMMA-SPACE-HASH PIC X(16) VALUE "trail, # comment".
    05 F-ESCAPED-QUOTE PIC X(15) VALUE "quote "" and , #".
    05 F-NEXT-LINE PIC X(4) VALUE "xy".
    05 F-LINE-SEPARATOR PIC X(5) VALUE "x y".
    05 F-PARAGRAPH-SEPARATOR PIC X(5) VALUE "x y".
PROCEDURE DIVISION.
    STOP RUN.
