IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N0 USAGE POINTER.
01 N1 USAGE POINTER.
01 N1-V USAGE COMP-2 VALUE 1.
01 N1-K PIC X(2) VALUE "a" & X"00".
01 N2 USAGE POINTER.
01 N2-V USAGE COMP-2 VALUE 2.
01 N2-K PIC X(2) VALUE "b" & X"00".
01 N-STATUS PIC S9(9) COMP-5.
01 MY-DATA USAGE POINTER.
PROCEDURE DIVISION.
    CALL "cJSON_CreateObject" RETURNING N0.
    CALL "cJSON_CreateNumber" USING BY VALUE N1-V RETURNING N1.
    CALL "cJSON_AddItemToObject" USING BY VALUE N0 BY REFERENCE N1-K BY VALUE N1 RETURNING N-STATUS.
    CALL "cJSON_CreateNumber" USING BY VALUE N2-V RETURNING N2.
    CALL "cJSON_AddItemToObject" USING BY VALUE N0 BY REFERENCE N2-K BY VALUE N2 RETURNING N-STATUS.
    SET MY-DATA TO N0.
    STOP RUN.
