IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-VALUE.
    10 F-REF PIC X(3) VALUE "foo".
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
