IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-HOST PIC X(9) VALUE "it's here".  *> a comment
    05 F-PORT PIC S9(18) COMP-5 VALUE 80.  *> another
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
