IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-NAME PIC X(5) VALUE "Alice".
    05 F-SCORES.
10 F-1 PIC X(5) VALUE "first".
10 F-2 PIC X(6) VALUE "second".
PROCEDURE DIVISION.
    STOP RUN.
