IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-A.
    10 FILLER PIC S9(18) COMP-5 VALUE 4294967296.
    10 FILLER PIC S9(18) COMP-5 VALUE 4294967297.
PROCEDURE DIVISION.
    STOP RUN.
