IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK-WRAPPER.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "CHECK" USING BY CONTENT 42.
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM CHECK.
END PROGRAM CHECK-WRAPPER.
