IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
*> after
01 MY-DATA PIC S9(18) COMP-5 VALUE 42.
PROCEDURE DIVISION.
    STOP RUN.
