IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-COLLECTION PIC X(5) VALUE "alpha".
    05 F-FEATURED-ENTRY.
10 F-ID PIC S9(18) COMP-5 VALUE 100.
10 F-LABEL PIC X(11) VALUE "first entry".
10 F-ENABLED PIC X(5) VALUE "FALSE".
10 F-RELATED-IDS.
15 FILLER PIC S9(18) COMP-5 VALUE 102.
15 FILLER PIC S9(18) COMP-5 VALUE 103.
PROCEDURE DIVISION.
    STOP RUN.
