IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "POST" USING BY CONTENT "hello".
    CALL "POST" USING BY CONTENT 42.
    CALL "POST" USING BY CONTENT "TRUE".
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. POST.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM POST.
END PROGRAM CHECK.
