IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "DOTHING" USING BY CONTENT 1.
    CALL "DOTHING" USING BY CONTENT 2.
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. DOTHING.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM DOTHING.
END PROGRAM CHECK.
