IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-PROTO.
    10 F-X PIC S9(18) COMP-5 VALUE 1.
    05 F-N.
    10 F-PROTO PIC S9(18) COMP-5 VALUE 3.
    05 F-Y PIC S9(18) COMP-5 VALUE 2.
PROCEDURE DIVISION.
    STOP RUN.
