IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-NAME PIC X(5) VALUE "Alice".
    05 F-TAGS.
10 FILLER PIC X(5) VALUE "TRUE".
10 FILLER PIC S9(18) COMP-5 VALUE 42.
10 FILLER PIC X(5) VALUE "apple".
PROCEDURE DIVISION.
    STOP RUN.
