IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 LITERAL-VALUE.
    05 F-KEY PIC X(23) VALUE "value "" # not a comment".  *> real
PROCEDURE DIVISION.
    STOP RUN.
