IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    *> comment ending backslash \ .
    05 F-X PIC S9(18) COMP-5 VALUE 1.
PROCEDURE DIVISION.
    STOP RUN.
