IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
*> before
*> inline
01 MY-DATA PIC X(5) VALUE "plain".
PROCEDURE DIVISION.
    STOP RUN.
