IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-08 PIC X(5) VALUE "value".
PROCEDURE DIVISION.
    STOP RUN.
