IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
*> note
01 MY-DATA PIC X(13) VALUE "hello # world".
PROCEDURE DIVISION.
    STOP RUN.
