IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA COMP-2 VALUE "hello # world"  *> note.
PROCEDURE DIVISION.
    MOVE "hello # world"  *> note TO MY-DATA.
    STOP RUN.
