IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    *> before
    05 F-ANSWER PIC S9(18) COMP-5 VALUE 42.  *> inline
    05 F-PLAIN PIC X(2) VALUE "ok".
    *> trailing
PROCEDURE DIVISION.
    STOP RUN.
