IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-MORNING PIC X(8) VALUE "09:30:00".
    05 F-AFTERNOON PIC X(8) VALUE "14:15:00".
    05 F-EVENING PIC X(8) VALUE "23:59:59".
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
