IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA PIC X(25) VALUE "2024-01-15T18:00:00+05:00".
PROCEDURE DIVISION.
    MOVE "2024-01-15T18:00:00+05:00" TO MY-DATA.
    STOP RUN.
