IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    *> comment
    05 F-NAME PIC X(5) VALUE "Alice".
    05 F-SCORE PIC X(1) VALUE SPACES.
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
