IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "PROCESS" USING BY CONTENT 0 BY CONTENT 1 BY CONTENT 2 BY CONTENT 3 BY CONTENT 4 BY CONTENT 5 BY CONTENT 6 BY CONTENT 7 BY CONTENT 8 BY CONTENT 9 BY CONTENT 10 BY CONTENT 11 BY CONTENT 12 BY CONTENT 13 BY CONTENT 14 BY CONTENT 15 BY CONTENT 16 BY CONTENT 17 BY CONTENT 18 BY CONTENT 19 BY CONTENT 20 BY CONTENT 21 BY CONTENT 22 BY CONTENT 23 BY CONTENT 24 BY CONTENT 25 BY CONTENT 26.
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. PROCESS.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM PROCESS.
END PROGRAM CHECK.
