IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER COMP-2 VALUE 1.100000.
    05 FILLER COMP-2 VALUE -2.200000.
    05 FILLER COMP-2 VALUE 3.300000.
PROCEDURE DIVISION.
    STOP RUN.
