IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-REF PIC X(5) VALUE "ref_x".
    05 FILLER PIC S9(18) COMP-5 VALUE 1.
    05 FILLER PIC S9(18) COMP-5 VALUE 2.
PROCEDURE DIVISION.
    STOP RUN.
