IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC S9(18) COMP-5 VALUE 1.
    05 FILLER PIC X(5) VALUE "email".
    05 FILLER PIC X(11) VALUE "a@gmail.com".
    05 FILLER PIC S9(18) COMP-5 VALUE 100.
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
