IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N0 USAGE POINTER.
01 N0-V PIC X(8) VALUE "a""b" & X"09" & "c" & X"C3" & X"A9" & X"00".
01 MY-DATA USAGE POINTER.
PROCEDURE DIVISION.
    CALL "cJSON_CreateString" USING BY REFERENCE N0-V RETURNING N0.
    SET MY-DATA TO N0.
    STOP RUN.
