IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-SCHEMA.
    10 F-REF PIC X(10) VALUE "#/defs/Foo".
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
