IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-A.

            10 FILLER PIC S9(18) COMP-5 VALUE 1.
            10 FILLER PIC S9(18) COMP-5 VALUE 2.
            10 FILLER PIC S9(18) COMP-5 VALUE 3.
  *> inline a
    05 F-B PIC S9(18) COMP-5 VALUE 2.  *> inline b
PROCEDURE DIVISION.
    STOP RUN.
