IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-A.
10 FILLER PIC S9(18) COMP-5 VALUE 1.
    05 F-B.
10 FILLER PIC X(1) VALUE "x".
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
