IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N0 USAGE POINTER.
01 MY-DATA USAGE POINTER.
PROCEDURE DIVISION.
    CALL "cJSON_CreateNull" RETURNING N0.
    SET MY-DATA TO N0.
    STOP RUN.
