IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA PIC X(1) VALUE SPACES.
PROCEDURE DIVISION.
    MOVE SPACES TO MY-DATA.
    STOP RUN.
