IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC X(21) VALUE "prefix ${HOME} suffix".
    05 FILLER PIC X(15) VALUE "${interpolated}".
PROCEDURE DIVISION.
    STOP RUN.
