IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-REF PIC X(5) VALUE "myVar".
PROCEDURE DIVISION.
    STOP RUN.
