IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC S9(18) COMP-5 VALUE 0.
    05 FILLER PIC X(5) VALUE "plain".
PROCEDURE DIVISION.
    STOP RUN.
