IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC X(10) VALUE "48656c6c6f".
    05 FILLER PIC X(1) VALUE SPACES.
PROCEDURE DIVISION.
    STOP RUN.
