IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 LITERAL-VALUE.
    05 FILLER PIC X(25) VALUE "2024-01-15T18:00:00+05:30".
PROCEDURE DIVISION.
    STOP RUN.
