IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
*> just a comment
01 MY-DATA PIC X(1) VALUE SPACES.
PROCEDURE DIVISION.
    *> just a comment
MOVE SPACES TO MY-DATA.
    STOP RUN.
