IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
*> just a comment
SPACES
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
