IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-S PIC X(6) VALUE "string".
    05 F-I PIC S9(18) COMP-5 VALUE 1.
    05 F-F COMP-2 VALUE 1.5.
    05 F-B PIC X(5) VALUE "TRUE".
    05 F-N PIC X(1) VALUE SPACES.
    05 F-D PIC X(10) VALUE "2024-01-15".
    05 F-DT PIC X(19) VALUE "2024-01-15T12:00:00".
    05 F-BY PIC X(10) VALUE "48656c6c6f".
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
