IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA PIC X(32) VALUE "2024-01-15T12:30:00.123456+00:00".
PROCEDURE DIVISION.
    STOP RUN.
