IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC S9(18) COMP-5 VALUE 999999999999999999.
    05 FILLER PIC S9(18) COMP-5 VALUE -999999999999999999.
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
