IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-REF PIC X(11) VALUE "schema.json".
PROCEDURE DIVISION.
    STOP RUN.
