IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-VALUE COMP-2 VALUE 0.0.
PROCEDURE DIVISION.
    STOP RUN.
