IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA PIC X(12) VALUE "ab c d".
PROCEDURE DIVISION.
    STOP RUN.
