IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA COMP-2 VALUE 3.140000.
PROCEDURE DIVISION.
    STOP RUN.
