IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "NEWVALUE" USING BY CONTENT 1.
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. NEWVALUE.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM NEWVALUE.
END PROGRAM CHECK.
