IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-SERVER.

        10 F-HOST PIC X(9) VALUE "localhost".
        10 F-PORT PIC X(1) VALUE SPACES.  *> not configured yet
        10 F-DEBUG PIC X(5) VALUE "TRUE".
PROCEDURE DIVISION.
    STOP RUN.
