IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-V PIC X(29) VALUE "a‪‫‬‭‮⁦⁧⁨⁩b".
PROCEDURE DIVISION.
    STOP RUN.
