IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-1 PIC X(3) VALUE "one".
    05 F-2 PIC X(3) VALUE "two".
    05 F-42 PIC X(6) VALUE "answer".
PROCEDURE DIVISION.
    STOP RUN.
