IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-X PIC X(1) VALUE "=".
    *> unrelated
PROCEDURE DIVISION.
    STOP RUN.
