IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
*> note
01 MY-DATA PIC X(1) VALUE SPACES.
PROCEDURE DIVISION.
    *> note
MOVE SPACES TO MY-DATA.
    STOP RUN.
