IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA PIC S9(18) COMP-5 VALUE 9223372036854775808.
PROCEDURE DIVISION.
    MOVE 9223372036854775808 TO MY-DATA.
    STOP RUN.
