IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-LOWER PIC S9(18) COMP-5 VALUE 3735928559.
    05 F-UPPER PIC S9(18) COMP-5 VALUE 31.
    05 F-NEGATIVE PIC S9(18) COMP-5 VALUE -16.
    05 F-ZERO PIC S9(18) COMP-5 VALUE 0.
PROCEDURE DIVISION.
    STOP RUN.
