IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "FETCH" USING BY CONTENT "hello".
    CALL "FETCH" USING BY CONTENT "world".
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. FETCH.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM FETCH.
END PROGRAM CHECK.
