IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-JSON PIC X(1) VALUE "x".
PROCEDURE DIVISION.
    STOP RUN.
