IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-A.
10 F-B.
15 F-C.
20 F-REF PIC X(4) VALUE "deep".
PROCEDURE DIVISION.
    STOP RUN.
