IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "F" USING BY CONTENT 2 BY CONTENT "hello".  *> trailing note
    CALL "F" USING BY CONTENT 3 BY CONTENT "world".  *> another note
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. F.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM F.
END PROGRAM CHECK.
