IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-ID PIC S9(18) COMP-5 VALUE 1.
    05 F-DESCRIPTION PIC X(28) VALUE "She said ""hello"", then waved".
    05 F-IS-DONE PIC X(5) VALUE "FALSE".
    05 F-BLOCKS.
10 FILLER PIC S9(18) COMP-5 VALUE 1.
10 FILLER PIC S9(18) COMP-5 VALUE 2.
10 FILLER PIC S9(18) COMP-5 VALUE 3.
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
