IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 LITERAL-VALUE.
    05 FILLER PIC X(5) VALUE "apple".
    05 FILLER PIC X(6) VALUE "banana".
    05 FILLER PIC X(6) VALUE "cherry".
PROCEDURE DIVISION.
    STOP RUN.
