IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC X(9) VALUE "a b c".
    05 FILLER PIC X(6) VALUE "a  b".
PROCEDURE DIVISION.
    STOP RUN.
