IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-PI COMP-2 VALUE 3.141592653589793.
PROCEDURE DIVISION.
    STOP RUN.
