IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-STARTS-AT PIC X(8) VALUE "09:30:00".
PROCEDURE DIVISION.
    STOP RUN.
