IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N0 USAGE POINTER.
01 N1 USAGE POINTER.
01 N1-V PIC X(9) VALUE "09:30:00" & X"00".
01 N1-K PIC X(10) VALUE "starts_at" & X"00".
01 MY-DATA USAGE POINTER.
01 CJSON-STATUS PIC S9(9) COMP-5.
PROCEDURE DIVISION.
    CALL "cJSON_CreateObject" RETURNING N0.
    CALL "cJSON_CreateString" USING BY REFERENCE N1-V RETURNING N1.
    CALL "cJSON_AddItemToObject" USING BY VALUE N0 BY REFERENCE N1-K BY VALUE N1 RETURNING CJSON-STATUS.
    SET MY-DATA TO N0.
    STOP RUN.
