IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 LITERAL-VALUE.
    05 F-KEY PIC X(7) VALUE """bang!""".  *> real
PROCEDURE DIVISION.
    STOP RUN.
