IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-A PIC X(1) VALUE SPACES.
    05 F-B PIC X(1) VALUE SPACES.
    *> trailing
PROCEDURE DIVISION.
    STOP RUN.
