IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-TIMES.
10 FILLER PIC X(8) VALUE "09:30:00".
10 FILLER PIC X(8) VALUE "17:45:00".
10 FILLER PIC X(8) VALUE "23:59:59".
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
