IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC S9(18) COMP-5 VALUE 1.
    05 FILLER COMP-2 VALUE 2.5.
    05 FILLER PIC S9(18) COMP-5 VALUE 3.
PROCEDURE DIVISION.
    STOP RUN.
