IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC X(11) VALUE "issue #{42}".
    05 FILLER PIC X(10) VALUE "color #red".
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
