IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "PROCESS" USING BY CONTENT 05 FILLER PIC S9(18) COMP-5 VALUE 1.
    05 FILLER PIC X(1) VALUE "x"..
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. PROCESS.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM PROCESS.
END PROGRAM CHECK.
