IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-V PIC X(5) VALUE "a﻿b".
PROCEDURE DIVISION.
    STOP RUN.
