IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA PIC X(5) VALUE "TRUE".
PROCEDURE DIVISION.
    STOP RUN.
