IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA PIC S9(18) COMP-5 VALUE -2147483649.
PROCEDURE DIVISION.
    STOP RUN.
