IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N0 USAGE POINTER.
01 N0-V USAGE COMP-2 VALUE -2147483649.
01 MY-DATA USAGE POINTER.
PROCEDURE DIVISION.
    CALL "cJSON_CreateNumber" USING BY VALUE N0-V RETURNING N0.
    SET MY-DATA TO N0.
    STOP RUN.
