IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 LITERAL-VALUE.
    05 FILLER PIC X(10) VALUE "48656c6c6f".
PROCEDURE DIVISION.
    STOP RUN.
