IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N0 USAGE POINTER.
01 N1 USAGE POINTER.
01 N1-V PIC X(11) VALUE "48656c6c6f" & X"00".
01 MY-DATA USAGE POINTER.
01 CJSON-STATUS PIC S9(9) COMP-5.
PROCEDURE DIVISION.
    CALL "cJSON_CreateArray" RETURNING N0.
    CALL "cJSON_CreateString" USING BY REFERENCE N1-V RETURNING N1.
    CALL "cJSON_AddItemToArray" USING BY VALUE N0 BY VALUE N1 RETURNING CJSON-STATUS.
    SET MY-DATA TO N0.
    STOP RUN.
