IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N0 USAGE POINTER.
01 N1 USAGE POINTER.
01 N1-V PIC X(6) VALUE "Alice" & X"00".
01 N1-K PIC X(5) VALUE "name" & X"00".
01 N2 USAGE POINTER.
01 N3 USAGE POINTER.
01 N3-V USAGE COMP-2 VALUE 10.
01 N4 USAGE POINTER.
01 N4-V USAGE COMP-2 VALUE 20.
01 N5 USAGE POINTER.
01 N5-V USAGE COMP-2 VALUE 30.
01 N2-K PIC X(7) VALUE "scores" & X"00".
01 MY-DATA USAGE POINTER.
01 CJSON-STATUS PIC S9(9) COMP-5.
01 M0 USAGE POINTER.
01 M1 USAGE POINTER.
01 M1-V PIC X(6) VALUE "Alice" & X"00".
01 M1-K PIC X(5) VALUE "name" & X"00".
01 M2 USAGE POINTER.
01 M3 USAGE POINTER.
01 M3-V USAGE COMP-2 VALUE 10.
01 M4 USAGE POINTER.
01 M4-V USAGE COMP-2 VALUE 20.
01 M5 USAGE POINTER.
01 M5-V USAGE COMP-2 VALUE 30.
01 M2-K PIC X(7) VALUE "scores" & X"00".
PROCEDURE DIVISION.
    CALL "cJSON_CreateObject" RETURNING N0.
    CALL "cJSON_CreateString" USING BY REFERENCE N1-V RETURNING N1.
    CALL "cJSON_AddItemToObject" USING BY VALUE N0 BY REFERENCE N1-K BY VALUE N1 RETURNING CJSON-STATUS.
    CALL "cJSON_CreateArray" RETURNING N2.
    CALL "cJSON_CreateNumber" USING BY VALUE N3-V RETURNING N3.
    CALL "cJSON_AddItemToArray" USING BY VALUE N2 BY VALUE N3 RETURNING CJSON-STATUS.
    CALL "cJSON_CreateNumber" USING BY VALUE N4-V RETURNING N4.
    CALL "cJSON_AddItemToArray" USING BY VALUE N2 BY VALUE N4 RETURNING CJSON-STATUS.
    CALL "cJSON_CreateNumber" USING BY VALUE N5-V RETURNING N5.
    CALL "cJSON_AddItemToArray" USING BY VALUE N2 BY VALUE N5 RETURNING CJSON-STATUS.
    CALL "cJSON_AddItemToObject" USING BY VALUE N0 BY REFERENCE N2-K BY VALUE N2 RETURNING CJSON-STATUS.
    SET MY-DATA TO N0.
    CALL "cJSON_CreateObject" RETURNING M0.
    CALL "cJSON_CreateString" USING BY REFERENCE M1-V RETURNING M1.
    CALL "cJSON_AddItemToObject" USING BY VALUE M0 BY REFERENCE M1-K BY VALUE M1 RETURNING CJSON-STATUS.
    CALL "cJSON_CreateArray" RETURNING M2.
    CALL "cJSON_CreateNumber" USING BY VALUE M3-V RETURNING M3.
    CALL "cJSON_AddItemToArray" USING BY VALUE M2 BY VALUE M3 RETURNING CJSON-STATUS.
    CALL "cJSON_CreateNumber" USING BY VALUE M4-V RETURNING M4.
    CALL "cJSON_AddItemToArray" USING BY VALUE M2 BY VALUE M4 RETURNING CJSON-STATUS.
    CALL "cJSON_CreateNumber" USING BY VALUE M5-V RETURNING M5.
    CALL "cJSON_AddItemToArray" USING BY VALUE M2 BY VALUE M5 RETURNING CJSON-STATUS.
    CALL "cJSON_AddItemToObject" USING BY VALUE M0 BY REFERENCE M2-K BY VALUE M2 RETURNING CJSON-STATUS.
    SET MY-DATA TO M0.
    STOP RUN.
