IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-NAME PIC X(5) VALUE "Alice".
    05 F-SCORES.
10 FILLER PIC S9(18) COMP-5 VALUE 10.
10 FILLER PIC S9(18) COMP-5 VALUE 20.
10 FILLER PIC S9(18) COMP-5 VALUE 30.
PROCEDURE DIVISION.
    STOP RUN.
