IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "SEND" USING BY CONTENT 05 F-A PIC S9(18) COMP-5 VALUE 1.
    05 F-B PIC X(1) VALUE "x"..
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. SEND.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM SEND.
END PROGRAM CHECK.
