IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC X(3) VALUE "a""b".
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
