IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-ITEM PIC X(8) VALUE "existing".
    *> This comment describes the next item.
    05 F-ITEM PIC X(4) VALUE "next".
PROCEDURE DIVISION.
    STOP RUN.
