IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER PIC X(5) VALUE "TRUE".
    05 FILLER COMP-2 VALUE 1.5.
    05 FILLER PIC X(1) VALUE SPACES.
    05 FILLER PIC X(10) VALUE "2020-01-01".
    05 FILLER PIC X(25) VALUE "2020-01-01T00:00:00+00:00".
    05 FILLER PIC X(1) VALUE SPACES.
PROCEDURE DIVISION.
    STOP RUN.
