IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-LINT.
10 FILLER PIC S9(18) COMP-5 VALUE 2.
10 FILLER PIC S9(18) COMP-5 VALUE 1.
    05 F-TEST.
10 FILLER PIC S9(18) COMP-5 VALUE 5.
10 FILLER PIC S9(18) COMP-5 VALUE 7.
PROCEDURE DIVISION.
    STOP RUN.
