IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N0 USAGE POINTER.
01 N1 USAGE POINTER.
01 N2 USAGE POINTER.
01 N2-V USAGE COMP-2 VALUE 1.
01 N3 USAGE POINTER.
01 N3-V PIC X(2) VALUE "a" & X"00".
01 N4 USAGE POINTER.
01 N5 USAGE POINTER.
01 N5-V USAGE COMP-2 VALUE 2.
01 N6 USAGE POINTER.
01 N6-V PIC X(2) VALUE "b" & X"00".
01 N-STATUS PIC S9(9) COMP-5.
01 MY-DATA USAGE POINTER.
PROCEDURE DIVISION.
    CALL "cJSON_CreateArray" RETURNING N0.
    CALL "cJSON_CreateArray" RETURNING N1.
    CALL "cJSON_CreateNumber" USING BY VALUE N2-V RETURNING N2.
    CALL "cJSON_AddItemToArray" USING BY VALUE N1 BY VALUE N2 RETURNING N-STATUS.
    CALL "cJSON_CreateString" USING BY REFERENCE N3-V RETURNING N3.
    CALL "cJSON_AddItemToArray" USING BY VALUE N1 BY VALUE N3 RETURNING N-STATUS.
    CALL "cJSON_AddItemToArray" USING BY VALUE N0 BY VALUE N1 RETURNING N-STATUS.
    CALL "cJSON_CreateArray" RETURNING N4.
    CALL "cJSON_CreateNumber" USING BY VALUE N5-V RETURNING N5.
    CALL "cJSON_AddItemToArray" USING BY VALUE N4 BY VALUE N5 RETURNING N-STATUS.
    CALL "cJSON_CreateString" USING BY REFERENCE N6-V RETURNING N6.
    CALL "cJSON_AddItemToArray" USING BY VALUE N4 BY VALUE N6 RETURNING N-STATUS.
    CALL "cJSON_AddItemToArray" USING BY VALUE N0 BY VALUE N4 RETURNING N-STATUS.
    SET MY-DATA TO N0.
    STOP RUN.
