IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-EXPLICIT-STRING PIC X(1) VALUE "5".
    05 F-SIX PIC X(21) VALUE "explicitly tagged key".
PROCEDURE DIVISION.
    STOP RUN.
