IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 LITERAL-VALUE.
    05 F-MESSAGE PIC X(15) VALUE "no comment here".
PROCEDURE DIVISION.
    STOP RUN.
