IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-MESSAGE PIC X(15) VALUE "no comment here".
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
