IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-WITHIN-I32 PIC S9(18) COMP-5 VALUE 1705320000.
    05 F-BEYOND-I32 PIC S9(18) COMP-5 VALUE 4085195400.
PROCEDURE DIVISION.
    STOP RUN.
