IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "INNER" USING BY CONTENT 1 BY CONTENT 2.
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. INNER.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM INNER.
END PROGRAM CHECK.
