IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER COMP-2 VALUE 0.0.
    05 FILLER COMP-2 VALUE 1.0.
    05 FILLER COMP-2 VALUE 1500.0.
    05 FILLER COMP-2 VALUE 0.001.
    05 FILLER COMP-2 VALUE 1.0e16.
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
