IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 FILLER COMP-2 VALUE 0.000000.
    05 FILLER COMP-2 VALUE 1.000000.
    05 FILLER COMP-2 VALUE 1500.000000.
    05 FILLER COMP-2 VALUE 0.001000.
PROCEDURE DIVISION.
    STOP RUN.
