IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N0 USAGE POINTER.
01 N1 USAGE POINTER.
01 N1-V PIC X(11) VALUE "2024-01-15" & X"00".
01 N1-K PIC X(5) VALUE "date" & X"00".
01 N2 USAGE POINTER.
01 N2-V PIC X(26) VALUE "2024-01-15T12:30:00+00:00" & X"00".
01 N2-K PIC X(9) VALUE "datetime" & X"00".
01 MY-DATA USAGE POINTER.
01 CJSON-STATUS PIC S9(9) COMP-5.
PROCEDURE DIVISION.
    CALL "cJSON_CreateObject" RETURNING N0.
    CALL "cJSON_CreateString" USING BY REFERENCE N1-V RETURNING N1.
    CALL "cJSON_AddItemToObject" USING BY VALUE N0 BY REFERENCE N1-K BY VALUE N1 RETURNING CJSON-STATUS.
    CALL "cJSON_CreateString" USING BY REFERENCE N2-V RETURNING N2.
    CALL "cJSON_AddItemToObject" USING BY VALUE N0 BY REFERENCE N2-K BY VALUE N2 RETURNING CJSON-STATUS.
    SET MY-DATA TO N0.
    STOP RUN.
