IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA PIC X(5) VALUE "hello".
PROCEDURE DIVISION.
    MOVE "hello" TO MY-DATA.
    STOP RUN.
