IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N0 USAGE POINTER.
01 N1 USAGE POINTER.
01 N1-V PIC X(6) VALUE "Alice" & X"00".
01 N1-K PIC X(5) VALUE "name" & X"00".
01 N2 USAGE POINTER.
01 N2-K PIC X(6) VALUE "score" & X"00".
01 N3 USAGE POINTER.
01 N3-V USAGE COMP-2 VALUE 30.
01 N3-K PIC X(4) VALUE "age" & X"00".
01 MY-DATA USAGE POINTER.
01 CJSON-STATUS PIC S9(9) COMP-5.
PROCEDURE DIVISION.
    CALL "cJSON_CreateObject" RETURNING N0.
    CALL "cJSON_CreateString" USING BY REFERENCE N1-V RETURNING N1.
    CALL "cJSON_AddItemToObject" USING BY VALUE N0 BY REFERENCE N1-K BY VALUE N1 RETURNING CJSON-STATUS.
    CALL "cJSON_CreateNull" RETURNING N2.
    CALL "cJSON_AddItemToObject" USING BY VALUE N0 BY REFERENCE N2-K BY VALUE N2 RETURNING CJSON-STATUS.
    CALL "cJSON_CreateNumber" USING BY VALUE N3-V RETURNING N3.
    CALL "cJSON_AddItemToObject" USING BY VALUE N0 BY REFERENCE N3-K BY VALUE N3 RETURNING CJSON-STATUS.
    SET MY-DATA TO N0.
    STOP RUN.
