IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-LINT.
10 FILLER PIC S9(18) COMP-5 VALUE 2.
10 FILLER PIC X(1) VALUE SPACES.
    05 F-TEST.
10 FILLER PIC S9(18) COMP-5 VALUE 5.
10 FILLER PIC X(7) VALUE "compile".
PROCEDURE DIVISION.
    STOP RUN.
