IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-HALF PIC X(26) VALUE "1979-05-27T07:32:00.500000".
    05 F-MILLI PIC X(26) VALUE "1979-05-27T07:32:00.100000".
    05 F-MAX-MILLI PIC X(26) VALUE "1979-05-27T07:32:00.999000".
    05 F-WHOLE PIC X(19) VALUE "1979-05-27T07:32:00".
PROCEDURE DIVISION.
    STOP RUN.
