IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    CALL "PROCESS" USING BY CONTENT 1 BY CONTENT "hello".
    CALL "PROCESS" USING BY CONTENT "two" BY CONTENT 0.
    CALL "PROCESS" USING BY CONTENT 3.5 BY CONTENT SPACES.
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. PROCESS.
PROCEDURE DIVISION.
    STOP RUN.
END PROGRAM PROCESS.
END PROGRAM CHECK.
