IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA PIC X(25) VALUE "2020-06-15T12:00:00+23:59".
PROCEDURE DIVISION.
    STOP RUN.
