IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-FIRST PIC X(3) VALUE "one".
    05 F-SECOND PIC X(3) VALUE "two".
    05 F-THIRD PIC X(5) VALUE "three".
PROCEDURE DIVISION.
    STOP RUN.
