IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-VALS.
10 FILLER PIC X(10) VALUE "2024-01-15".
10 FILLER PIC X(8) VALUE "09:30:00".
PROCEDURE DIVISION.
    INITIALIZE MY-DATA.
    STOP RUN.
