IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-DATA.
    05 F-ASTRAL PIC X(4) VALUE "😀".
    05 F-MIXED PIC X(6) VALUE "a😀b".
    05 F-COUNT PIC S9(18) COMP-5 VALUE 2.
    05 F-LIST.
    10 FILLER PIC X(4) VALUE "😀".
    10 FILLER PIC S9(18) COMP-5 VALUE 1.
    05 F-NESTED.
    10 F-INNER PIC X(4) VALUE "😀".
PROCEDURE DIVISION.
    STOP RUN.
